"use strict"

const kaomojiCollection = {
    "kaomoji": {
		"thumbs down": [
			"(((p(>o<)q))) Boo!",
			"p(●｀□´●)q",
			"p(╬ Ò ‸ Ó)q",
			"p(′Д`ﾟq)))",
			"( ′Д`)p",
			"｡ﾟ.o｡ｬ━━━q(#ﾟзﾟ#)p━━━ﾀﾞｧ｡o.ﾟ｡"
		],
		"angry": [
			"(๑•̀д•́๑)",
			"(ʘ言ʘ╬)",
			"(°言°怒)",
			"щ(`Д´щ;)",
			"(๑•̀ㅁ•́๑)✧",
			"＼`•̀益•́´／",
			"ヽ(`д´；)/",
			"(｀Д´)",
			"ヽ(*｀ﾟД´)ﾉ",
			"(＃｀д´)ﾉ",
			"(•ˋ _ ˊ•)",
			"ヾ(｀ε´)ﾉ",
			"WHATщ(ﾟДﾟщ)",
			"(　｀_ゝ´)",
			"(#｀ε´)",
			"(*≧m≦*)"
		],
        "angry middle finger fuck": [
            "凸(｀0´)凸",
            "凸ಠ益ಠ)凸",
            "凸(⊙▂⊙✖ )",
            "┌П┐(►˛◄’!)",
            "凸(｀⌒´メ)凸",
            "( ︶︿︶)_╭∩╮"
        ],
        "bears": [
			"ʕ •ᴥ•ʔ",
			"ʕ •ᴥ•ʔゝ☆",
			"＼ʕ •ᴥ•ʔ／",
			"＼ʕ •ᴥ•ʔ＼",
			"／ʕ •ᴥ•ʔ／",
			"ʕ ˵• ₒ •˵ ʔ ",
			"ʕ •ₒ• ʔ ",
			"ʕง•ᴥ•ʔง",
			"ᕕʕ •ₒ• ʔ୨ ",
			"ʕ　·ᴥʔ",
			"ʕ　·ᴥ·ʔ",
			"ʕ·ᴥ·　ʔ",
			"ʕᴥ·　ʔ",
			"ʕ •ᴥ•ʔ",
			"ʕ ﾟ ● ﾟʔ",
			"ʕ； •`ᴥ•´ʔ",
			"Σʕﾟᴥﾟﾉʔﾉ",
			"“φʕ•ᴥ•oʔ",
			"ʕ*ﾉᴥﾉʔ",
			"ᕦʕ •ᴥ•ʔᕤ",
			"┏ʕ •ᴥ•ʔ┛",
			"ʕ´•ᴥ•`ʔσ”",
			"ʅʕ•ᴥ•ʔʃ",
			"ʕノ)ᴥ(ヾʔ",
			"ʕ/　·ᴥ·ʔ/",
			"ʕ╯• ⊱ •╰ʔ",
			"ʕ☞ᴥ ☜ʔ",
			"ʕᴥ• ʔ☝",
			"ʕ　·ᴥ·ʔ",
			"ʕ·ᴥ·　ʔ",
			"ʕ·ᴥ·˵　ʔ",
			"ʕ　˵·ᴥ·ʔ",
			"ʕ´•ᴥ•`ʔ",
			"ʕ♡˙ᴥ˙♡ʔ",
			"ʕ≧ᴥ≦ʔ",
			"ʕ； •`ᴥ•´ʔ",
			"╲ʕ·ᴥ·　╲ʔ",
			"ʕ•ᴥ•ʔ",
			"ʕ￫ᴥ￩　ʔ",
			"ʕ – ᴥ – ʔ",
			"・・・ʕ ˵ ̿–ᴥ ̿– ˵ ʔ",
			"ᶘ ͡°ᴥ͡°ᶅ",
			"ᶘಠᴥಠᶅ",
			"ᶘ ᵒᴥᵒᶅ",
			"┬┴┬┴┤ᵒᴥᵒᶅ├┬┴┬┴",
			"┬┴┬┴┤•ᴥ•ʔ├┬┴┬┴",
			"ʕノ•ᴥ•ʔノ ︵ ┻━┻",
			"ʕ – ㉨ – ʔ",
			"ʕ ̿–㉨ ̿– ʔ",
			"(ó㉨ò)ﾉ♡",
			"ᕦᶘ ᵒ㉨ᵒᶅᕤ",
			"ᶘ ᵒ㉨ᵒᶅ",
			"ʕ•㉨•ʔ",
			"ʕ •㉨• ʔ",
			"ʕ´•㉨•`ʔ",
			"ʕ　·㉨·ʔ",
			"ʕ≧㉨≦ʔ",
			"(✪㉨✪)",
			"（´㉨｀*）",
			"⊂(ο･㉨･ο）⊃",
			"⊂(￣(ｴ)￣)⊃",
			"(*￣(ｴ)￣*)",
			"〔´（エ）｀〕",
			"((*￣(ｴ)￣)ﾉ ",
			"⊂(●￣(エ)￣●)⊃",
			"┳┳ヾ(T(エ)Tヽ)",
			"(￣(ｴ)￣)ﾉ",
			"(≧(ｴ)≦ )",
			"（´･(ｪ)･｀）",
			"（ㅎ(ｪ)ㅎ）",
			"（●ㅎ(ｪ)ㅎ●）",
			"（´•(ｪ)•｀）",
			"ʕʘ̅͜ʘ̅ʔ",
			"ʕっ˘ڡ˘ςʔ",
			"ʕ – o – ʔ",
			"ʕ – _ – ʔ",
			"ʕ´ڡ｀*ʔ",
			"ʕ •́؈•̀)",
			"ʕ•┏ل͜┓•ʔ",
			"ʕʘ̅┏ل͜┓ʘ̅ʔ",
			"ʕㅎ┏ل͜┓ㅎʔ",
        ],
        "blushing flower girl": [
            "(˶◕‿◕˶✿)",
            "(⁄ ⁄◕⁄ω⁄◕⁄ ⁄✿)"
        ],
        "cats": [
            "ฅ(＾・ω・＾ฅ)",
            `චᆽච`,
			"=^._.^= ∫",
			"ฅ(＾・ω・＾ฅ)",
			"（＾・ω・＾✿）",
			"（＾・ω・＾❁）",
			"(=^･ω･^=)",
			"(^・x・^)",
			"(=^･ｪ･^=))ﾉ彡☆",
			"(^._.^)ﾉ☆( _ _).oO",
			"(=‐ω‐=)",
			"(=｀ω´=)",
			"(=｀ェ´=)",
			"（=´∇｀=）",
			"(=´∇｀=)",
			"(=^ ◡ ^=)	",
			"(=^-ω-^=)",
			"(＾º◡º＾❁)",
			"(^≗ω≗^)",
			"（Φ ω Φ）",
			"( ⓛ ω ⓛ *)",
			"(Ф∀Ф)",
			"(ФДФ)",
			"( ↀДↀ)✧",
			"Σ(;Φ ω Φ)",
			"（งΦ Д Φ）ง",
			"(˵Φ ω Φ˵)",
			"(Φ ᆺ Φ)",
			"(Φ ౪ Φ)",
			"(Φ ₒ Φ)",
			"(๑ↀᆺↀ๑)",
			"(๑✪ᆺ✪๑)",
			"(ﾐΦ ﻌ Φﾐ)ﾉ",
			"(ﾐΦ ﻌ Φﾐ)∫",
			"(ﾐⓛᆽⓛﾐ)✧",
			"චᆽච",
			"(ﾐචᆽචﾐ)",
			"(=චᆽච=)",
			"(₌චᆽච₌)",
			"(≈චᆽච≈)",
			"(◍චᆽච◍)",
			"(๑චᆽච๑)",
			"ฅ(=චᆽච=ฅ)",
			"(ﾐටᆽටﾐ)",
			"(=ච㉨ච=)",
			"(=ච ω ච=)",
			"(=ච ﻌ ච=)",
			"(=ච⊱ච=)",
			"(=චᆽච=)",
			"(=මᆽම=)",
			"(=මිᆽමි=)",
			"(=ඒᆽඒ=)",
			"(=ඔᆽඔ=)",
			"(=ලᆽල=)",
			"(=◕ᆽ◕ฺ=)",
			"(=ʘᆽʘ=)",
			"(=⊝ᆽ⊝=)",
			"(ﾐㅇᆽㅇﾐ)",
			"(=ㅇᆽㅇ=)",
			"(₌ㅇᆽㅇ₌)",
			"(≈ㅇᆽㅇ≈)♡",
			"(=✖ᆽ✖=)",
			"(=✪ᆽ✪=)",
			"(ﾐㅇ ༝ ㅇﾐ)",
			"(=ㅇ༝ㅇ=)",
        ],
        "christmas xmas": [
            "(＾∇^*)ノ⌒☆ -=★ -=☆*Merry X’mas*☆",
            "。∈・^ミβ(*´ω｀人´ω｀*)*:..｡o○☆*ﾟ¨ﾟMerry Christmas .｡.:*"
        ],
        "confused": [
            "「(°ヘ°)",
            "( ・◇・)？",
            "ヾ(´･ ･｀｡)ノ”",
            "⊙.☉"
        ],
        "dogs": [
			"▼・ᴥ・▼",
			" ▼(´ᴥ`)▼",
			" U ´ᴥ` U",
			" U・ᴥ・U",
			" U・♀・U",
			" U ´x` U",
			" (U・x・U)",
			"U・♀・U",
			"(❍ᴥ❍ʋ)",
			"V●ω●V",
			"V✪ω✪V",
			"V✪⋏✪V",
			"∪ ̿–⋏ ̿–∪",
			"∪･ω･∪",
			"໒( ●ᴥ ●)ʋ",
			"໒( = ᴥ =)ʋ",
			"໒( ̿･ ᴥ ̿･ )ʋ",
			"໒( ̿❍ ᴥ ̿❍)ʋ",
			"▽･ｪ･▽ﾉ”",
        ],
        "jailed": [
            "||Φ|(|ﾟ|∀|ﾟ|)|Φ||",
            "━━━━||Φ|(|´|Д|`|)|Φ||━━━━"
        ],
        "flower girl": [
            "(　◕‿◕✿)",
            "(◕▽◕✿)"
        ],
        "sad flower girl": [
            "(◕‸ ◕✿) *pout*",
            "(◕︿◕✿)"
        ],
        "table flipping throwing": [
            "(╯°□°）╯︵ ┻━┻",
            "┻━┻ミ＼(≧ﾛ≦＼)"
        ],
        "bears table flipping throwing": [
            "ʕノ•ᴥ•ʔノ ︵ ┻━┻",
            " ┳┳ヾ(T(エ)Tヽ)"
        ],
        "setting the table": [
            "┬──┬ ノ( ゜-゜ノ)",
            "(ヘ･_･)ヘ┳━┳"
        ],
        "good morning": [
            "(*^｡^*)Rise (*^o^*)And ＼(*^0^*)／Shineｰ!!",
            "(_ _)(-.-)(~O~)*yawn*・・(~O~)(-.-)"
        ],
        "kissing kisses": [
            "( ˘ ³˘)♥",
            "(ɔˆ ³(ˆ⌣ˆc)"
        ],
        "throwing kisssing kisses": [
            "★⌒ヽ(●’､＾●)Kiss!",
            "(^з^)-☆Chu!!"
        ],
        "hugs hugging": [
            "(つ・▽・)つ⊂(・▽・⊂)",
            "(つ≧▽≦)つ⊂(・ヮ・⊂)"
        ],
        "happy birthday": [
            "[＼／]…..φ(・д・。) Happy birthday♪",
            "Happy♪ヾ|*ﾟ∀ﾟ*|ﾉ” Birthday♪"
        ],
        "mad": [
            "┗(｀Дﾟ┗(｀ﾟДﾟ´)┛ﾟД´)┛",
            "!!!!|┛*｀Д´|┛・・~~┻━┻　┳━┳"
        ],
        "nervous":[
            "(ﾟωﾟ；)",
            "(*ﾟдﾟ*)ﾄﾞｷﾄﾞｷ",
            "┣¨キ(*ﾟДﾟ*)┣¨キ"
        ],
        "pigs": [
			"(´・(oo)・｀)",
			"(V´・(oo)・｀V)",
			"(▽´・(oo)・｀▽)",
			"(´Φ(oo)Φ｀)",
			"(V´｡(oo)｡｀V)",
			"(▽•̀(oo)•́ ▽)",
			"(▼✪(oo)✪▼)",
			"(▽❍(oo)❍▽)",
			"(▽-(00)-▽)♡",
			"(･ั(00)･ั)",
			"(´･(00)･｀)",
			"(´・(oo)・｀) ",
			"(´♡(oo)♡｀)",
			"(´；(oo)；｀)",
			"(V −(●●)−V)",
			"σ（￣（●●）￣）",
			"(＞（●●）＜)",
			"（○￣（●●）￣○）",
			"(○＞（●●）＜○)",
			"（☆（●●）☆）",
			"（`（●●）´）",
			"σ（￣（●●）￣）",
			"&lt;(｀（●●）´)&gt;",
			"&lt;(○｀（●●）´○)&gt;",
			"(　^ (●●)－)＝☆",
			"(&gt;（●●）&lt;)",
			"Σ（￣（●●）￣）",
			"(T（●●）T)/~~~",
			"(○｀（●●）´○)",
			"（`（●●）´）",
			"m(-（●●）-)m",
			"(V −(●●)−V)",
			"₍˄•͈⚇•͈˄₎",
			"(▼￣⚇￣▼)",
			"(V｀⚇´V)",
        ],
        "deep crying face": [
            "ಥ_ಥ",
            "ಥ╭╮ಥ"
        ],
        "denko shoboon": [
            "(´・ω・｀)",
            "Σ(´・ω・｀)"
        ],
        "raise your dongers": [
            "ヽ༼ຈل͜ຈ༽ﾉ",
            "✺◟༼ຈ ل͜ ຈ༽◞✺"
        ],
        "strolling happy gary": [
            "ᕕ( ᐛ )ᕗ",
            "ᐠ( ᐛ )ᐟ"
        ],
        "it’s here kitaaa": [
            "ｷﾀ━(ﾟ∀ﾟ)━!",
            "ｷﾀ━━━(Дﾟ(○=(ﾟ∀ﾟ)=○)Дﾟ)━━━!!"
        ],
        "laughing": [
            "(´∀｀)",
            "ヽ（´∀｀）ノ"
        ],
        "lenny face": [
            "( ͡° ͜ʖ ͡°)",
            "ᕦ( ͡° ͜ʖ ͡°)ᕤ"
        ],
        "look of disapproval": [
            "ಠ_ಠ",
            "ლ(ಠ益ಠლ)"
        ],
        "love": [
            "(๑♡3♡๑)",
            "(｡♥‿♥｡)"
        ],
        "orz":[
            "_|￣|○",
            "il||li ＿|￣|○ il||l",
            "///orz///",
            "▄█▀█●"
        ],
        "shrug": [
            `¯\\\_(ツ)_/¯`,
            `¯\\\_㋡_/¯`,
			`¯\_(ツ)_/¯`,
			`¯\(ツ)/¯`,
			`ʅ(ツ)ʃ`,
			`乁(ツ)ㄏ`,
			`乁(ツ)∫`,
			`ƪ(ツ)∫`,
			`¯\_₍ッ₎_/¯`,
			`乁₍ッ₎ㄏ`,
			`ʅ₍ッ₎ʃ`,
			`¯\_(シ)_/¯`,
			`¯\_(ツ゚)_/¯`,
			`乁(ツ゚)ㄏ`,
			`¯\_㋡_/¯`,
			`┐_㋡_┌`,
			`┐_(ツ)_┌━☆ﾟ.*･｡ﾟ`,
			`ʅ(°_°)ʃ`,
			`ʅ(°‿°)ʃ`,
			`ʅ(°﹃°)ʃ`,
			`ʅ(°⊱,°)ʃ`,
			`ʅ(°,ʖ°)ʃ`,
			`ʅ(°益°)ʃ`,
			`ʅ(°_◞°)ʃ`,
			`ʅ(°ヮ°)ʃ`,
			`┐(°_°)ʃ`,
			`┐(°‿°)┌`,
			`┐(°﹃°)┌`,
			`┐(°⊱,°)┌`,
			`┐(°,ʖ°)┌`,
			`┐(°益°)┌`,
			`┐(°_◞°)┌`,
			`┐(°,_｣°)┌`,
			`┐(°ヮ°)┌`,
			`¯\_(°_°)_/¯`,
			`¯\_(°‿°)_/¯`,
			`¯\_(°﹃°)_/¯`,
			`¯\_(°⊱,°)_/¯`,
			`¯\_(°,ʖ°)_/¯`,
			`¯\_(°益°)_/¯`,
			`¯\_(°_◞°)_/¯`,
			`¯\_(°ヮ°)_/¯`,
			`¯\_(°╭╮°)_/¯`,
			`¯\_(°∀°)_/¯`,
			`¯\_(°,_｣°)_/¯`,
			`¯\_(°◞౪◟°)_/¯`,
			`¯\_(°ᴥ°)_/¯`,
			`͡¯\_(°_o)_/¯`,
			`¯\_(⌣̯̀ ⌣́)_/¯`,
			`¯\_(ಠ_ಠ)_/¯`,
			`¯\_(ತ_ʖತ)_/¯`,
			`¯\_(ಸ ‿ ಸ)_/¯`,
			`¯\_(ಸ◞౪◟ಸ)_/¯`,
			`¯\_(　´∀｀)_/¯`,
			`¯\_(Φ ᆺ Φ)_/¯`,
			`¯\_(´◉◞౪◟◉)_/¯`,
			`¯\_(´・ω・｀)_/¯`,
			`¯\_(˶′◡‵˶)_/¯`,
			`¯\_(ಥ‿ಥ)_/¯`,
			`¯\_(；へ：)_/¯`,
			`¯\_(ᗒᗩᗕ)_/¯`,
			`¯\_( ´･ω･)_/¯`,
			`¯\_(๑❛ᴗ❛๑)_/¯`,
			`¯\_(´°̥̥̥̥̥̥̥̥ω°̥̥̥̥̥̥̥̥｀)_/¯`,
			`ʅ（´◔౪◔）ʃ`,
			`┐(￣ー￣)┌`,
			`★｡･:*¯\_(ツ)_/¯*:･ﾟ★`,
        ],
        "smiling": [
            "（＾－＾）",
            "（＾O＾）"
        ],
        "smug face": [
            "ಸ‿ಸ",
            "ಇ(ಸ‿ಸ)ಇ"
        ],
        "sparkles": [
            "✧･ﾟ: *✧･ﾟ:* 　　 *:･ﾟ✧*:･ﾟ✧",
            "*＊✿❀　❀✿＊*"
        ],
        "cheerful": [
            "(❁´◡`❁)",
            "ヾ(＠^∇^＠)ノ"
        ],
        "excited": [
            "✧ ─=≡Σ((( つ•̀ω•́)つ",
            "✖‿✖",
            "(((o(*ﾟ▽ﾟ*)o)))"
        ],
        "blushing flattered": [
            "(〃 ω 〃)",
            "‧⁺( ᵒ̴̶̷̥́ ◡ ᵒ̴̶̷̣̥̀ )⁺‧"
        ],
        "sad crying": [
            "o（ｉДｉ）o",
            "˚‧º·(˚ ˃̣̣̥⌓˂̣̣̥ )‧º·˚"
        ],
        "sad depressed": [
            "(◞ ‸ ◟ㆀ)",
            "(╯︵╰)"
        ],
        "seal": [
            "(ᵔᴥᵔ)"
        ],
        "weird awkward": [
            "( ་ ⍸ ་ )",
            "(　☉д⊙)"
        ],
        "weird creepy": [
            "(´⊙◞⊱​◟⊙｀)​",
            "(´◉◞⊖◟◉｀)"
        ],
        "weird wtf gross": [
            "༼;´༎ຶ ۝ ༎ຶ༽",
            "(◞≼⓪≽◟⋌⋚⋛⋋◞≼⓪≽)"
        ],
        "weird hide stalkerific": [
            "|ω・)",
            "┬┴┬┴┤(･_├┬┴┬┴"
        ]
    },
    "nameMap": {
        // eslint-disable-line
    },
    "nameArr": [
        // eslint-disable-line
    ]
}

const kaomoji = kaomojiCollection.kaomoji

for (const fullName in kaomoji) {
	fullName.split(" ").forEach(partiallyName => {
		while (kaomojiCollection.nameMap[partiallyName]) {
            partiallyName = `_${partiallyName}`
        }
        kaomojiCollection.nameMap[partiallyName] = fullName
        kaomojiCollection.nameArr.push(partiallyName)
	})
}

const nameMap = kaomojiCollection.nameMap
const nameArr = kaomojiCollection.nameArr
